---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SlabShapeFailures.SlabShapeWarnVerticesCoincident
source: html/c2162757-de0a-e366-b880-b5fe6d2c28fe.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SlabShapeFailures.SlabShapeWarnVerticesCoincident Property

Some slab shape edit vertices were too close to each other or too close to an edge.

## Syntax (C#)
```csharp
public static FailureDefinitionId SlabShapeWarnVerticesCoincident { get; }
```